app/Controllers/Obce.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `obec`.`nazev` as `nazevObce`, `okres`.`nazev` as `nazevOkresu`, Count(*) as pocet
FROM `obec`
JOIN `cast_obce` ON `cast_obce`.`obec`=`obec`.`kod`
LEFT JOIN `ulice` ON `cast_obce`.`kod`=`ulice`.`cast_obce`
LEFT JOIN `adresni_misto` ON `ulice`.`kod`=`adresni_misto`.`ulice`
LEFT JOIN `okres` ON `obec`.`okres`=`okres`.`kod`
GROUP BY `obec`.`kod`
) CI_count_all_results
SELECT `obec`.`nazev` as `nazevObce`, `okres`.`nazev` as `nazevOkresu`, Count(*) as pocet
FROM `obec`
JOIN `cast_obce` ON `cast_obce`.`obec`=`obec`.`kod`
LEFT JOIN `ulice` ON `cast_obce`.`kod`=`ulice`.`cast_obce`
LEFT JOIN `adresni_misto` ON `ulice`.`kod`=`adresni_misto`.`ulice`
LEFT JOIN `okres` ON `obec`.`okres`=`okres`.`kod`
GROUP BY `obec`.`kod`
ORDER BY `pocet` DESC
 LIMIT 25
---
    public function adresniMista()
    {
        $perPage = $this->config->perPage;

        $data["obce"] = $this->obec->select('obec.nazev as nazevObce, okres.nazev as nazevOkresu, Count(*) as pocet')->join('cast_obce', 'cast_obce.obec=obec.kod')->join('ulice', 'cast_obce.kod=ulice.cast_obce', 'left')->join('adresni_misto', 'ulice.kod=adresni_misto.ulice', 'left')->join('okres', 'obec.okres=okres.kod', 'left')->groupBy('obec.kod')->orderBy('pocet', 'desc')->paginate($perPage);

SELECT `ulice`.`nazev` as `nazevUlice`, `obec`.`nazev` as `nazevObce`
FROM `ulice`
INNER JOIN `cast_obce` ON `cast_obce`.`kod`=`ulice`.`cast_obce`
INNER JOIN `obec` ON `obec`.`kod`=`cast_obce`.`obec`
ORDER BY `obec`.`nazev` DESC
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `nazev`, Count(*) as pocet, `kod`
FROM `ulice`
WHERE `virtualni` = 0
GROUP BY `nazev`
) CI_count_all_results
SELECT `nazev`, Count(*) as pocet, `kod`
FROM `ulice`
WHERE `virtualni` = 0
GROUP BY `nazev`
ORDER BY `pocet` DESC
 LIMIT 150, 25
---
    public function nazvyUlic()
    {
        $perPage = $this->config->perPage;
        $ulice2 = $this->ulice->select('ulice.nazev as nazevUlice, obec.nazev as nazevObce')->join('cast_obce', 'cast_obce.kod=ulice.cast_obce', 'inner')->join('obec', 'obec.kod=cast_obce.obec', 'inner')->orderBy('obec.nazev', 'asc')->findAll();
        $data["ulice"] = $this->ulice->select("nazev, Count(*) as pocet, kod")->where('virtualni', 0)->groupBy('nazev')->orderBy('pocet', 'desc')->paginate($perPage);

SELECT `obec`.`kod` as `kodObce`, `cast_obce`.`nazev` as `nazevCasti`
FROM `obec`
INNER JOIN `cast_obce` ON `cast_obce`.`obec`=`obec`.`kod`
ORDER BY `nazevCasti` ASC
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `obec`.`nazev`, `obec`.`kod`, Count(*) as pocet
FROM `obec`
INNER JOIN `cast_obce` ON `obec`.`kod`=`cast_obce`.`obec`
GROUP BY `obec`.`kod`
) CI_count_all_results
SELECT `obec`.`nazev`, `obec`.`kod`, Count(*) as pocet
FROM `obec`
INNER JOIN `cast_obce` ON `obec`.`kod`=`cast_obce`.`obec`
GROUP BY `obec`.`kod`
ORDER BY `pocet` DESC
 LIMIT 75, 25
---
    public function nejviceCasti() {
        $perPage = $this->config->perPage;
        $castObce2 = $this->obec->select('obec.kod as kodObce, cast_obce.nazev as nazevCasti')->join('cast_obce', 'cast_obce.obec=obec.kod', 'inner')->orderBy('nazevCasti', 'asc')->findAll();
        $data['castObce2'] = $this->uliceLib->groupValues($castObce2, 'kodObce', 'nazevCasti');
        $data['castObce'] = $this->obec->select('obec.nazev, obec.kod, Count(*) as pocet')->join('cast_obce', 'obec.kod=cast_obce.obec', 'inner')->groupBy('obec.kod')->orderBy('pocet', 'desc')->paginate($perPage);